# TargetIsBarBend Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..TargetIsBarBend Method
RebarConstraint Class See Also
---
Returns true if the RebarTargetConstraintType of the RebarConstraint is 'BarBend'.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool TargetIsBarBend()
```

Visual Basic
---
```text
Public Function TargetIsBarBend As Boolean
```

Visual C++
---
```text
public:
bool TargetIsBarBend()
```

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace